Vue.component('tab-info', {
    template: `<div class="tabs-panel">
                <img src="./img/Miles_Davis.jpg" class="info-pic">
                <div class="info-text">
                <h2>Майлз Дэвис</h2>
                <p>(<i>англ.</i> <strong>Miles Davis</strong>. 26 мая 1926, Олтон — 28 сентября 1991, Санта-Моника) — американский джазовый трубач и бэнд-лидер, оказавший значительнейшее влияние на развитие музыки XX века. Дэвис стоял у истоков множества стилей и направлений в джазе, таких как модальный джаз (англ. modal jazz), кул-джаз (cool jazz) и фьюжн (fusion).</p>
                <p>Около 50 лет работы Дэвиса определили звучание джаза для трёх поколений слушателей. Записи Дэвиса позволяют проследить развитие современного джаза от бибопа конца 1940-х годов до современных экспериментальных направлений. В отличие от многих других джазменов, Дэвис никогда не был ограничен каким-то одним джазовым стилем. Отмечая широту интересов и многогранность его таланта, Дюк Эллингтон сравнивал Дэвиса с Пикассо.</p>
                </div>
                </div>`
});

Vue.component('tab-biography', {
    template: `<div class="tabs-panel">
        <div class="info-text">
            <h2>Биография</h2>
            <h3>Ранний период творчества</h3>
            <p>Майлз Дьюи Дэвис III (англ. Miles Dewey Davis III) родился и вырос в штате Иллинойс.</p>
            <p>Начал играть на трубе в 13 лет. Намеревался стать академическим исполнителем, однако довольно быстро добился признания как джазмен, выступая с ансамблями Сонни Стита и Кларка Терри. В 1945, учась в Джульярдской музыкальной школе в Нью-Йорке, посещал джем-сейшнз на 52-й улице. В ноябре этого же года вошёл в квинтет Чарли Паркера, записав «Now’s The Time» и «Billie’s Bounce». Не обладая виртуозной техникой, Майлс Дэвис постепенно вырабатывал собственное звучание — длинные ноты без вибрато, частое использование сурдины, короткие фразы и многозначительные паузы. По мнению критика Андре Одэра: «Дэвис придал музыке Паркера интимный характер».</p>
            <p>В конце 1945 года уехал в Сент-Луис, чтобы присоединиться к оркестру Бенни Картера, но работа в биг-бэнде ему не понравилась и поэтому он через несколько месяцев вернулся в Нью-Йорк и вновь играл с Паркером. В 1946 заменил Диззи Гиллеспи в оркестре Билли Экстайна, в то же время выступал с Сонни Ститом и Джином Аммонсом. В 1948 судьба опять свела его с Паркером, кроме того его партнёрами стали Сонни Роллинз, Джон Льюис и Макс Роуч.</p>
            <h3>Период cool jazz</h3>
            <p>В 1948 году собрал нонет, который вошёл в историю джаза как CAPITOL BAND — первый ансамбль так называемого «прохладного джаза». Состав нонета был для того времени достаточно оригинален — труба, тромбон, валторна, туба, альт- и баритон-саксофон, фортепиано, контрабас, ударные. Термин «кул» впервые появился на пластинке Дэвиса «The Birth Of The Cool» (1949), на которой были записаны композиции и аранжировки Джерри Маллигэна, Джона Льюиса, Гила Эванса и Джона Каризи.</p>
            <h3>1950-е годы, «третье течение»</h3>
            <p>Карьера Дэвиса была неровной, в 1950-е годы он увлёкся наркотиками и после записей 1950—1951 годов с составом METRONOME ALL STARS не появлялся на сцене 4 года. Только в 1955 году он собрал ансамбль, в который вошли Джон Колтрейн, Рэд Гарлэнд (англ.)русск., Пол Чемберс (англ.)русск., Филли Джо Джонс (иногда присоединялись Кэннонбол Эддерли и Билл Эванс). Во второй половине 1950-х годов Дэвис становится признанным лидером современного джаза и начинает экспериментировать в области формы и гармонии, заменяя традиционные аккордовые последовательности остинатными басовыми формулами (альбомы Milestones, 1958, Kind Of Blue, 1959). В то же время он записывает (на трубе и флюгельгорне) с оркестром Гила Эванса сюиты, которые можно отнести к «третьему течению» — Miles Ahead (1957), Porgy and Bess (1958), Sketches of Spain (1959).</p>
            <h3>Акустический джаз, европейские гастроли</h3>
            <p>
              В 1960-е годы Дэвис собрал новый квинтет, в который пригласил молодых виртуозов — Уэйна Шортера, Херби Хэнкока, Рона Картера, Тони Уильямса, триумфально гастролировал в Европе и выпустил альбомы, которые считаются вершиной развития акустического джаза — Davis In Europe (1963), Seven Steps to Heaven (1963), My Funny Valentine (1965), E.S.P. (1965), Miles Smiles (1967) и другие.
            </p>
            <h3>Период джаз-рока</h3>
            <p>
              Новый виток популярности начался в конце 1960-х годов, когда Дэвис обратил внимание на электроинструменты, на энергетику рок-музыки, отказался от использования тем, напоминающих джазовые стандарты, разработал новый тип аранжировки (продолжительные композиции цементировались короткими риффами) и пригласил в свою группу молодых исполнителей — Джо Завинула, Джона Маклафлина, Чика Кориа, Дэйва Холланда, Ленни Уайта (англ.)русск., Билли Кобэма, Стива Гроссмана (англ.)русск., Аирто Морейру. С ними он записал ряд джаз-роковых альбомов — Filles De Kilimanjaro (1968), In a Silent Way (1969) и Bitches Brew (1970). В 1970-е годы Дэвис утвердил на сцене новый тип джазового шоу, после чего стал частым гостем американских и европейских джаз- и рок-фестивалей.</p>
              <p>Однако здоровье Дэвиса ухудшалось. Смерть близких ему музыкантов, воспаление лёгких, автомобильная авария и повреждение коленного сустава, наркотики и неприятности с полицией — всё это привело к сильной депрессии, и после 1975 года он не появлялся на сцене 6 лет.
              </p>
              <h3>Фанк-рок джаз</h3>
              <p>
              О выздоровлении и возвращении возвестил альбом «The Man With A Horn» (1981). В оркестре вновь появились новые имена (он всегда умел открывать таланты) — Джон Скофилд, Кенни Гарретт, Майк Стерн (англ.)русск., Эл Фостер, Маркус Миллер, Боб Берг (англ.)русск. и другие. Новый стиль, который можно охарактеризовать как фанк-рок-джаз, был представлен альбомом «Tutu» (1986); Майк Зверин назвал его «звуковой дорожкой десятилетия»[где?]. Дэвис продолжал гастролировать вплоть до своей кончины в 1991 году.
            </p>
            <h3>Личная жизнь</h3>
            <p>
             С 1981 по 1988 год был женат на американской актрисе Сисели Тайсон.
            </p>
        </div>
    </div>`
});

Vue.component('tab-contribution', {
    template: `<div class="tabs-panel">
                <div class="info-text">
                    <h2>Вклад в развитие музыки</h2>
                    <p>Среди его главных достижений:</p>
                    <ul>
                        <li>Cоздание оригинального стиля игры на трубе, который впервые проявился в записях, сделанных Дэвисом с Чарли Паркером в середине 1940-х годов и который оказал влияние на огромное количество трубачей, играющих в стиле бибоп и кул (прохладный джаз);</li>
                        <li>Майлс Дэвис стоял у истоков таких направлений в джазе, как фьюжн и джаз-рок;</li>
                        <li>Запись основополагающих альбомов для т. н. прохладного джаза — Birth of the Cool (1949), модального джаза — Kind of Blue (1959), стиля джаз-фьюжн — In a Silent Way и Bitches Brew (оба записаны в 1969 году).</li>
                        <li>Альбом «In a Silent Way» в 2002 году был включён в рейтинг The 25 Most Influential Ambient Albums Of All Time — список альбомов, оказавших наибольшее влияние на развитие эмбиента.</li>
                    </ul>
                </div>
            </div>`
});

Vue.component('tab-discography', {
    template: `<div class="tabs-panel">
        <div class="info-text">
            <h2>Избранная дискография</h2>
            <ul style="font-size: 0.7em">
                <li>Round About Midnight (1955—56)</li>
                <li>Miles Ahead (1957)</li>
                <li>Milestones (1958)</li>
                <li>Porgy and Bess (1958)</li>
                <li>Sketches of Spain (1959—1960)</li>
                <li>Someday My Prince Will Come (1961)</li>
                <li>Kind of Blue (1959)</li>
                <li>Miles Davis at Carnegie Hall (1961)</li>
                <li>Seven Steps to Heaven (1963)</li>
                <li>Miles Smiles (1966)</li>
                <li>Sorcerer (1967)</li>
                <li>Nefertiti (1967)</li>
                <li>Miles in the Sky (1968)</li>
                <li>Filles de Kilimanjaro (1968)</li>
                <li>In a Silent Way (1969)</li>
                <li>Bitches Brew (1969)</li>
                <li>Big Fun (1969—72)</li>
                <li>Live-Evil (1970)</li>
                <li>Live at Fillmore East (1970)</li>
                <li>Black Beauty (1970)</li>
                <li>Get Up With It (1974)</li>
                <li>On the Corner (1972)</li>
                <li>Live at Philharmonic Hall (1972)</li>
                <li>Agharta (1975)</li>
                <li>Pangaea (1975)</li>
                <li>Tutu (1986)</li>
                <li>Doo-Bop (1991)</li>
            </ul>
        </div>
    </div>`
})

let app = new Vue({
    el: '#app',
    data: {
        tabTitles: [{
            name: 'О музыканте',
            shortcut: 'info'
        }, {
            name: 'Биография',
            shortcut: 'biography'
        }, {
            name: 'Лепта',
            shortcut: 'contribution'
        },{
            name: 'Дискография',
            shortcut: 'discography'
        }],
        currentTab: 'info'
    },
    computed: {
        currentTabComponent() {
			return 'tab-' + this.currentTab;
		}
    }
});
